#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_route_table.private[1]: Refreshing state... [id=rtb-0abf679bb1740444b]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0018fcc8ea5ffe5fc]
aws_subnet.public[0]: Refreshing state... [id=subnet-0b88a2ab22b1322cb]
aws_subnet.public[2]: Refreshing state... [id=subnet-0b0f853e6025e91bc]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c84f8d0ad3c56cfe]
aws_route_table.private[0]: Refreshing state... [id=rtb-0cea77bee1877feb6]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0f1bd8ec35c831269]
aws_security_group.ec2_security_group: Refreshing state... [id=sg-04166b61218279d18]
aws_route_table.public: Refreshing state... [id=rtb-0582bf82a3d824f28]
aws_security_group.lb_security_group: Refreshing state... [id=sg-0a2dd361001ed310e]
aws_subnet.public[1]: Refreshing state... [id=subnet-0d2972e74555e10a1]
aws_route_table.private[2]: Refreshing state... [id=rtb-0d039f06d32d1a528]
data.aws_iam_policy_document.assume_role: Reading...
data.aws_ami.amazon_ami: Reading...
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3760307347]
aws_vpc.this: Refreshing state... [id=vpc-069d6a9d9922d4177]
data.aws_iam_policy_document.vpc_flowlog_policy: Reading...
data.aws_iam_policy_document.vpc_flowlog_policy: Read complete after 0s [id=3442509011]
data.aws_ami.amazon_ami: Read complete after 0s [id=ami-07251f912d2a831a3]
aws_subnet.private[0]: Refreshing state... [id=subnet-02e55227189baf148]
aws_subnet.private[1]: Refreshing state... [id=subnet-08bc5808e184a64f3]
aws_subnet.private[2]: Refreshing state... [id=subnet-0b11d75deb9403c2b]
aws_internet_gateway.this-igw: Refreshing state... [id=igw-005f315f4b1c2892d]
aws_route.internet-route: Refreshing state... [id=r-rtb-0582bf82a3d824f281080289494]
aws_instance.app-server[0]: Refreshing state... [id=i-06e487e79e688be75]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-02e3b8426e6f63103]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f9e34b58ee7ff0d9]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0708951427f4beff9]
aws_instance.app-server[2]: Refreshing state... [id=i-0778f1b6df0723280]
aws_instance.app-server[1]: Refreshing state... [id=i-0c5a268fa605bc997]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cw_loggroup will be created
  + resource "aws_cloudwatch_log_group" "cw_loggroup" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "example"
      + retention_in_days = 0
      + tags_all          = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
        }
    }

  # aws_flow_log.app1 will be created
  + resource "aws_flow_log" "app1" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + log_group_name           = (known after apply)
      + max_aggregation_interval = 600
      + tags_all                 = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # aws_iam_role.vpc_flowlog_role will be created
  + resource "aws_iam_role" "vpc_flowlog_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "vpc_flowlog_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy.vpc_flowlog_role will be created
  + resource "aws_iam_role_policy" "vpc_flowlog_role" {
      + id     = (known after apply)
      + name   = "vpc_flowlog_role"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:DescribeLogStreams",
                          + "logs:DescribeLogGroups",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = (known after apply)
    }

  # aws_instance.app-server[0] must be replaced
-/+ resource "aws_instance" "app-server" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:743794601996:instance/i-06e487e79e688be75" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "us-east-2a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-06e487e79e688be75" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-01e79a07e45367bb9" -> (known after apply)
      ~ private_dns                          = "ip-10-20-20-12.us-east-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.20.20.12" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ subnet_id                            = "subnet-02e55227189baf148" # forces replacement -> (known after apply) # forces replacement
        tags                                 = {
            "Name" = "app-server-1"
        }
      ~ tags_all                             = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
            # (1 unchanged element hidden)
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "f8c969d3cfc2ce542bf59b5c0eaf7a583743503c" -> "9ea6f797c2878361f94d9f508aad35b4b4039b50"
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-04166b61218279d18",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-08b29088b827e33c8" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.app-server[1] must be replaced
-/+ resource "aws_instance" "app-server" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:743794601996:instance/i-0c5a268fa605bc997" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "us-east-2b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0c5a268fa605bc997" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0d20961c6ea1d0bd2" -> (known after apply)
      ~ private_dns                          = "ip-10-20-20-43.us-east-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.20.20.43" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ subnet_id                            = "subnet-08bc5808e184a64f3" # forces replacement -> (known after apply) # forces replacement
        tags                                 = {
            "Name" = "app-server-2"
        }
      ~ tags_all                             = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
            # (1 unchanged element hidden)
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "f8c969d3cfc2ce542bf59b5c0eaf7a583743503c" -> "9ea6f797c2878361f94d9f508aad35b4b4039b50"
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-04166b61218279d18",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-02dfc518e7b25e460" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.app-server[2] must be replaced
-/+ resource "aws_instance" "app-server" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:743794601996:instance/i-0778f1b6df0723280" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "us-east-2c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0778f1b6df0723280" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0819f4692364e5012" -> (known after apply)
      ~ private_dns                          = "ip-10-20-20-86.us-east-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.20.20.86" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ subnet_id                            = "subnet-0b11d75deb9403c2b" # forces replacement -> (known after apply) # forces replacement
        tags                                 = {
            "Name" = "app-server-3"
        }
      ~ tags_all                             = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
            # (1 unchanged element hidden)
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "f8c969d3cfc2ce542bf59b5c0eaf7a583743503c" -> "9ea6f797c2878361f94d9f508aad35b4b4039b50"
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-04166b61218279d18",
        ] -> (known after apply)
        # (5 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0a0b1d320c970bd9f" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_internet_gateway.this-igw will be updated in-place
  ~ resource "aws_internet_gateway" "this-igw" {
        id       = "igw-005f315f4b1c2892d"
      ~ tags     = {
          ~ "Name" = "app-1-gateway" -> "Application-1-gateway"
        }
      ~ tags_all = {
          ~ "Name"   = "app-1-gateway" -> "Application-1-gateway"
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
        }
      ~ vpc_id   = "vpc-069d6a9d9922d4177" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lb.front will be created
  + resource "aws_lb" "front" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = false
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = false
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "front"
      + security_groups            = (known after apply)
      + subnets                    = (known after apply)
      + tags                       = {
          + "Environment" = "front"
        }
      + tags_all                   = {
          + "Environment" = "front"
          + "Source"      = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)
    }

  # aws_lb_listener.front_end will be created
  + resource "aws_lb_listener" "front_end" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 80
      + protocol          = "HTTP"
      + ssl_policy        = (known after apply)
      + tags_all          = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # aws_lb_target_group.front will be created
  + resource "aws_lb_target_group" "front" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "application-front"
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
        }
      + target_type                        = "instance"
      + vpc_id                             = (known after apply)

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 10
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 3
          + unhealthy_threshold = 2
        }
    }

  # aws_lb_target_group_attachment.attach-app1[0] will be created
  + resource "aws_lb_target_group_attachment" "attach-app1" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # aws_lb_target_group_attachment.attach-app1[1] will be created
  + resource "aws_lb_target_group_attachment" "attach-app1" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # aws_lb_target_group_attachment.attach-app1[2] will be created
  + resource "aws_lb_target_group_attachment" "attach-app1" {
      + id               = (known after apply)
      + port             = 80
      + target_group_arn = (known after apply)
      + target_id        = (known after apply)
    }

  # aws_route.internet-route must be replaced
-/+ resource "aws_route" "internet-route" {
      ~ id                     = "r-rtb-0582bf82a3d824f281080289494" -> (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      ~ origin                 = "CreateRoute" -> (known after apply)
      ~ route_table_id         = "rtb-0582bf82a3d824f28" # forces replacement -> (known after apply) # forces replacement
      ~ state                  = "active" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_route_table.private[0] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-2:743794601996:route-table/rtb-0cea77bee1877feb6" -> null
      - id               = "rtb-0cea77bee1877feb6" -> null
      - owner_id         = "743794601996" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "app-1-private-1"
        } -> null
      - tags_all         = {
          - "Name" = "app-1-private-1"
        } -> null
      - vpc_id           = "vpc-069d6a9d9922d4177" -> null
    }

  # aws_route_table.private[1] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-2:743794601996:route-table/rtb-0abf679bb1740444b" -> null
      - id               = "rtb-0abf679bb1740444b" -> null
      - owner_id         = "743794601996" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "app-1-private-2"
        } -> null
      - tags_all         = {
          - "Name" = "app-1-private-2"
        } -> null
      - vpc_id           = "vpc-069d6a9d9922d4177" -> null
    }

  # aws_route_table.private[2] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-2:743794601996:route-table/rtb-0d039f06d32d1a528" -> null
      - id               = "rtb-0d039f06d32d1a528" -> null
      - owner_id         = "743794601996" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Name" = "app-1-private-3"
        } -> null
      - tags_all         = {
          - "Name" = "app-1-private-3"
        } -> null
      - vpc_id           = "vpc-069d6a9d9922d4177" -> null
    }

  # aws_route_table.public will be destroyed
  # (because aws_route_table.public is not in configuration)
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-east-2:743794601996:route-table/rtb-0582bf82a3d824f28" -> null
      - id               = "rtb-0582bf82a3d824f28" -> null
      - owner_id         = "743794601996" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-005f315f4b1c2892d"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "app-1-public"
        } -> null
      - tags_all         = {
          - "Name" = "app-1-public"
        } -> null
      - vpc_id           = "vpc-069d6a9d9922d4177" -> null
    }

  # aws_route_table.this-rt will be created
  + resource "aws_route_table" "this-rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "Application-1-route-table"
        }
      + tags_all         = {
          + "Name"   = "Application-1-route-table"
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-0f9e34b58ee7ff0d9" -> (known after apply)
      ~ route_table_id = "rtb-0cea77bee1877feb6" -> (known after apply)
      ~ subnet_id      = "subnet-02e55227189baf148" # forces replacement -> (known after apply) # forces replacement
    }

  # aws_route_table_association.private[1] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-0708951427f4beff9" -> (known after apply)
      ~ route_table_id = "rtb-0abf679bb1740444b" -> (known after apply)
      ~ subnet_id      = "subnet-08bc5808e184a64f3" # forces replacement -> (known after apply) # forces replacement
    }

  # aws_route_table_association.private[2] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-02e3b8426e6f63103" -> (known after apply)
      ~ route_table_id = "rtb-0d039f06d32d1a528" -> (known after apply)
      ~ subnet_id      = "subnet-0b11d75deb9403c2b" # forces replacement -> (known after apply) # forces replacement
    }

  # aws_route_table_association.public[0] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0018fcc8ea5ffe5fc" -> null
      - route_table_id = "rtb-0582bf82a3d824f28" -> null
      - subnet_id      = "subnet-0b88a2ab22b1322cb" -> null
    }

  # aws_route_table_association.public[1] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0c84f8d0ad3c56cfe" -> null
      - route_table_id = "rtb-0582bf82a3d824f28" -> null
      - subnet_id      = "subnet-0d2972e74555e10a1" -> null
    }

  # aws_route_table_association.public[2] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0f1bd8ec35c831269" -> null
      - route_table_id = "rtb-0582bf82a3d824f28" -> null
      - subnet_id      = "subnet-0b0f853e6025e91bc" -> null
    }

  # aws_security_group.ec2_security_group will be destroyed
  # (because aws_security_group.ec2_security_group is not in configuration)
  - resource "aws_security_group" "ec2_security_group" {
      - arn                    = "arn:aws:ec2:us-east-2:743794601996:security-group/sg-04166b61218279d18" -> null
      - description            = "Allow inbound and outbound traffic to EC2 instances from load balancer security group" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-04166b61218279d18" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-0a2dd361001ed310e",
                ]
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "Instance-SG" -> null
      - owner_id               = "743794601996" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "app-1-instance-sg"
        } -> null
      - tags_all               = {
          - "Name" = "app-1-instance-sg"
        } -> null
      - vpc_id                 = "vpc-069d6a9d9922d4177" -> null
    }

  # aws_security_group.http-sg will be created
  + resource "aws_security_group" "http-sg" {
      + arn                    = (known after apply)
      + description            = "allow inbound http traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "from my ip range"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "allow_http_access"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Application-1-sg"
        }
      + tags_all               = {
          + "Name"   = "Application-1-sg"
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_security_group.lb_security_group will be destroyed
  # (because aws_security_group.lb_security_group is not in configuration)
  - resource "aws_security_group" "lb_security_group" {
      - arn                    = "arn:aws:ec2:us-east-2:743794601996:security-group/sg-0a2dd361001ed310e" -> null
      - description            = "Allow inbound and outbound traffic to load balancer from the internet." -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0a2dd361001ed310e" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "LB-SG-IN" -> null
      - owner_id               = "743794601996" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "app-1-lb-sg"
        } -> null
      - tags_all               = {
          - "Name" = "app-1-lb-sg"
        } -> null
      - vpc_id                 = "vpc-069d6a9d9922d4177" -> null
    }

  # aws_subnet.private[0] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:743794601996:subnet/subnet-02e55227189baf148" -> (known after apply)
      ~ availability_zone_id                           = "use2-az1" -> (known after apply)
      ~ cidr_block                                     = "10.20.20.0/27" -> "10.20.20.0/28" # forces replacement
      ~ id                                             = "subnet-02e55227189baf148" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "743794601996" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name" = "app-1-private-1" -> "Application-1-private"
        }
      ~ tags_all                                       = {
          ~ "Name"   = "app-1-private-1" -> "Application-1-private"
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
        }
      ~ vpc_id                                         = "vpc-069d6a9d9922d4177" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_subnet.private[1] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:743794601996:subnet/subnet-08bc5808e184a64f3" -> (known after apply)
      ~ availability_zone_id                           = "use2-az2" -> (known after apply)
      ~ cidr_block                                     = "10.20.20.32/27" -> "10.20.20.16/28" # forces replacement
      ~ id                                             = "subnet-08bc5808e184a64f3" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "743794601996" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name" = "app-1-private-2" -> "Application-1-private"
        }
      ~ tags_all                                       = {
          ~ "Name"   = "app-1-private-2" -> "Application-1-private"
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
        }
      ~ vpc_id                                         = "vpc-069d6a9d9922d4177" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_subnet.private[2] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:743794601996:subnet/subnet-0b11d75deb9403c2b" -> (known after apply)
      ~ availability_zone_id                           = "use2-az3" -> (known after apply)
      ~ cidr_block                                     = "10.20.20.64/27" -> "10.20.20.32/28" # forces replacement
      ~ id                                             = "subnet-0b11d75deb9403c2b" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "743794601996" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name" = "app-1-private-3" -> "Application-1-private"
        }
      ~ tags_all                                       = {
          ~ "Name"   = "app-1-private-3" -> "Application-1-private"
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
        }
      ~ vpc_id                                         = "vpc-069d6a9d9922d4177" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_subnet.public[0] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-2:743794601996:subnet/subnet-0b88a2ab22b1322cb" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2a" -> null
      - availability_zone_id                           = "use2-az1" -> null
      - cidr_block                                     = "10.20.20.96/27" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0b88a2ab22b1322cb" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "743794601996" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "app-1-public-1"
        } -> null
      - tags_all                                       = {
          - "Name" = "app-1-public-1"
        } -> null
      - vpc_id                                         = "vpc-069d6a9d9922d4177" -> null
    }

  # aws_subnet.public[1] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-2:743794601996:subnet/subnet-0d2972e74555e10a1" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2b" -> null
      - availability_zone_id                           = "use2-az2" -> null
      - cidr_block                                     = "10.20.20.128/27" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0d2972e74555e10a1" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "743794601996" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "app-1-public-2"
        } -> null
      - tags_all                                       = {
          - "Name" = "app-1-public-2"
        } -> null
      - vpc_id                                         = "vpc-069d6a9d9922d4177" -> null
    }

  # aws_subnet.public[2] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-2:743794601996:subnet/subnet-0b0f853e6025e91bc" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2c" -> null
      - availability_zone_id                           = "use2-az3" -> null
      - cidr_block                                     = "10.20.20.160/27" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0b0f853e6025e91bc" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "743794601996" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "app-1-public-3"
        } -> null
      - tags_all                                       = {
          - "Name" = "app-1-public-3"
        } -> null
      - vpc_id                                         = "vpc-069d6a9d9922d4177" -> null
    }

  # aws_vpc.this must be replaced
-/+ resource "aws_vpc" "this" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:743794601996:vpc/vpc-069d6a9d9922d4177" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.20.20.0/24" -> "10.20.20.0/26" # forces replacement
      ~ default_network_acl_id               = "acl-04b2056114271f340" -> (known after apply)
      ~ default_route_table_id               = "rtb-0e8a45e88cd8855b0" -> (known after apply)
      ~ default_security_group_id            = "sg-000dfc0ba92ae0185" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-004ba8a36aaf520f6" -> (known after apply)
      ~ enable_classiclink                   = false -> (known after apply)
      ~ enable_classiclink_dns_support       = false -> (known after apply)
      ~ id                                   = "vpc-069d6a9d9922d4177" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-0e8a45e88cd8855b0" -> (known after apply)
      ~ owner_id                             = "743794601996" -> (known after apply)
      ~ tags                                 = {
          ~ "Name" = "app-1" -> "Application-1"
        }
      ~ tags_all                             = {
          ~ "Name"   = "app-1" -> "Application-1"
          + "Source" = "https://github.com/kunduso/add-aws-elb-ec2-terraform"
        }
        # (3 unchanged attributes hidden)
    }

Plan: 23 to add, 1 to change, 23 to destroy.

Changes to Outputs:
  + instance_app-server_public_dns = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + load_balancer_dns_name         = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: TFplan.JSON

To perform exactly these actions, run the following command to apply:
    terraform apply "TFplan.JSON"

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*